# Элементами множеств А, P, Q являются натуральные числа,
# причём P = {2, 4, 6, 8, 10, 12, 14, 16, 18, 20}, Q = {3, 6, 9, 12, 15, 18, 21, 24, 27, 30}. Известно, что выражение
# ( (x ∈ A) → (x ∈ P) ) ∧ ( (x ∈ Q) → ¬(x ∈ A) )
# истинно (то есть принимает значение 1) при любом значении переменной х.
# Определите наибольшее возможное количество элементов в множестве A.

P = [2, 4, 6, 8, 10, 12, 14, 16, 18, 20]
Q = [3, 6, 9, 12, 15, 18, 21, 24, 27, 30]

A = set(i for i in range(0, 40))

def f(x, A):
    return ((x in A) <= (x in P)) and ((x in Q) <= (x not in A))

for x in range(40):
    if not f(x, A):
        A.remove(x)

print(len(sorted(A)))

# Ответ: 7

#-----------------------------------------------------------------------------------------------------------------------

# # Элементами множеств А, P, Q являются натуральные числа,
# # причём P = {1, 3, 5, 7, 9, 11, 13, 15, 17, 19, 21}, Q = {3, 6, 9, 12, 15, 18, 21, 24, 27, 30}. Известно, что выражение
# # ((x ∈ P) → (x ∈ A)) ∨ (¬(x ∈ A) → ¬(x ∈ Q))
# # истинно ( т. е. принимает значение 1) при любом значении переменной х.
# # Определите наименьшее возможное значение суммы элементов множества A.
#
# P = [1, 3, 5, 7, 9, 11, 13, 15, 17, 19, 21]
# Q = [3, 6, 9, 12, 15, 18, 21, 24, 27, 30]
#
# A = set()
#
# def f(x,A):
#     return ((x in P) <= (x in A)) or ((x not in A) <= (x not in Q))
#
# for x in range(50):
#     if not f(x, A):
#         A.add(x)
#
# print(sum(A))
#
# # Ответ: 48