# На числовой прямой даны два отрезка: P = [5, 30] и Q = [14, 23].
# Укажите наибольшую возможную длину промежутка A, для которого формула
# ((x ∈ P) ≡ (x ∈ Q)) → ¬(x ∈ A)
# тождественно истинна, то есть принимает значение 1 при любом значении переменной х.

p1, p2, q1, q2 = 5, 30, 14, 23
P = [i/10 for i in range(p1 * 10, p2 * 10 + 1)]
Q = [i/10 for i in range(q1 * 10, q2 * 10 + 1)]

A = set(i/10 for i in range(3 * 10, 35 * 10 + 1))

def f(x, A):
    return ((x in P) == (x in Q)) <= (x not in A)


for x in (i/10 for i in range(3 * 10, 35 * 10 + 1)):
    if not f(x, A):
        A.remove(x)

print(sorted(A))

#Вывод
#[5.0, 5.1, 5.2, 5.3, 5.4, 5.5, 5.6, 5.7, 5.8, 5.9, 6.0, 6.1, 6.2, 6.3, 6.4, 6.5, 6.6, 6.7, 6.8, 6.9, 7.0, 7.1, 7.2,
# 7.3, 7.4, 7.5, 7.6, 7.7, 7.8, 7.9, 8.0, 8.1, 8.2, 8.3, 8.4, 8.5, 8.6, 8.7, 8.8, 8.9, 9.0, 9.1, 9.2, 9.3, 9.4, 9.5,
# 9.6, 9.7, 9.8, 9.9, 10.0, 10.1, 10.2, 10.3, 10.4, 10.5, 10.6, 10.7, 10.8, 10.9, 11.0, 11.1, 11.2, 11.3, 11.4, 11.5,
# 11.6, 11.7, 11.8, 11.9, 12.0, 12.1, 12.2, 12.3, 12.4, 12.5, 12.6, 12.7, 12.8, 12.9, 13.0, 13.1, 13.2, 13.3, 13.4,
# 13.5, 13.6, 13.7, 13.8, 13.9, 23.1, 23.2, 23.3, 23.4, 23.5, 23.6, 23.7, 23.8, 23.9, 24.0, 24.1, 24.2, 24.3, 24.4,
# 24.5, 24.6, 24.7, 24.8, 24.9, 25.0, 25.1, 25.2, 25.3, 25.4, 25.5, 25.6, 25.7, 25.8, 25.9, 26.0, 26.1, 26.2, 26.3,
# 26.4, 26.5, 26.6, 26.7, 26.8, 26.9, 27.0, 27.1, 27.2, 27.3, 27.4, 27.5, 27.6, 27.7, 27.8, 27.9, 28.0, 28.1, 28.2,
# 28.3, 28.4, 28.5, 28.6, 28.7, 28.8, 28.9, 29.0, 29.1, 29.2, 29.3, 29.4, 29.5, 29.6, 29.7, 29.8, 29.9, 30.0]
# Тоесть - [5;14) и (23;30]
# Наибольший отрезок = [5;14)
# Ответ - 9

# ----------------------------------------------------------------------------------------------------------------------

# # На числовой прямой даны два отрезка: D = [17; 58] и C = [29; 80].
# # Укажите наименьшую возможную длину такого отрезка A, для которого логическое выражение
# # (x ∈ D) → ((¬(x ∈ C)∧ ¬(x ∈ A)) → ¬(x ∈ D))
# # истинно (т. е. принимает значение 1) при любом значении переменной х.
#
# d1, d2, c1, c2 = 17, 58, 29, 80
# D = [i/10 for i in range(d1 * 10, d2 * 10 + 1)]
# C = [i/10 for i in range(c1 * 10, c2 * 10 + 1)]
#
# A = set()
#
# def f(x, A):
#     return (x in D) <= (((x not in C) and (x not in A)) <= (x not in D))
#
# for x in (i/10 for i in range(10 * 10, 100 * 10)):
#     if not f(x,A):
#         A.add(x)
#
# print(sorted(A))
#
# # [17;29)
# # Ответ: 12

# ----------------------------------------------------------------------------------------------------------------------

#
# # На числовой прямой даны два отрезка: P = [25; 50] и Q = [32; 47].
# # Укажите наибольшую возможную длину промежутка A, для которого формула
# # (¬ (x ∈ A) → (x ∈ P)) → ((x ∈ A) → (x ∈ Q))
# # тождественно истинна, то есть принимает значение 1 при любом значении переменной х.
#
# p1, p2, q1, q2 = 25, 50, 32, 47
# P = [i / 10 for i in range(p1 * 10, p2 * 10 + 1)]
# Q = [i / 10 for i in range(q1 * 10, q2 * 10 + 1)]
#
# A = set(i / 10 for i in range(20 * 10, 55 * 10))
#
# def f(x, A):
#     return ((x not in A) <= (x in P)) <= ((x in A) <= (x in Q))
#
# for x in (i / 10 for i in range(20 * 10, 55 * 10)):
#     if not f(x, A):
#         A.remove(x)
#
# print(sorted(A))
#
# # [32; 47]
# # Ответ: 15